{
  "Job Description Role: Field Sales and Client Acquisition Job Type:": {
    "jd": "Job Description\n\nRole:  Field Sales and Client Acquisition\nJob Type: Full Time \nLocation: (Branch name) To be filled\n\n\nWho we are?\nWe are India's largest marketplace and a one-stop expert solution for all business needs, empowering 82 lakh suppliers by connecting them with ~20.6 crore buyers across the nation.\nIndiaMART - A One-Stop Shop solution for all Businesses. IndiaMART is a 29-year-young organization. It is India’s Largest B2B Marketplace. \nDigital Boom - In this Era of the E-Commerce Industry and Digitalization, We are the only market leaders into the B2B E-commerce Marketplace having 60% (approx) market share in the B2B e-commerce industry.\n\nWhat will you do as a Sales and Business Development Associate?\n\nAs a Sales and Business Development Associate, your primary goal is to drive growth by identifying new opportunities, building strong client relationships, and delivering tailored solutions. You'll be the first point of contact for potential clients, engaging them through calls, emails, and meetings to understand their needs and present our offerings. Using various tools, you'll research markets, track leads, and collaborate with teams to convert interest into long-term partnerships.\nThe selected candidate will undergo our specialized training and onboarding program – Shubharambh – and will be mentored by our expert sales and business leaders to deliver the following outcomes:\n1. Generating leads from our registered sellers and convert them into paid sellers by personalized presentations of IndiaMART paid services. \n2. Create new sales opportunities for the company's products and services \n3. Systematic follow-up with the client for time-bound closure of the sale. \n4. Ensure timely collection of payments as per the finalised terms.\n\nWhat benefits will you receive?\n\nA great part of joining IndiaMART is the CTC, benefits and perks associated with our job. We provide full training, equipment, and a range of benefits, including:\nAnnual CTC - INR 3.6 Lakh + Sales Incentives\nConveyance Allowance for Field Visits\nMedical Benefits - up to 2 lakh of Mediclaim + 8 Lakh of Life personal Insurance\nEducation Assistance – up to 1 lac per year to enhance for completing educational programs of your own choice\nLifestyle benefits and retail discounts through our internal tie-ups\n\nWhat qualifications do we need from you?\nPostgraduate degree (preferably MBA) with a minimum of 9 months of work experience\nWillingness to travel locally within the city\nMust own a two-wheeler with a valid Registration Certificate (RC) and Driving License (DL)\nNote: This is a field-based role.\nIf this role sounds like it’s for you, then click on “Apply” Tab to start the application process!\n\n\n“IndiaMART is an equal opportunity employer committed to building a diverse and inclusive workforce. We base hiring decisions on skills and experience, and we value your drive to innovate, simplify, and create.”\n\n",
    "questions": []
  }
}